{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "conv2d_184", "class_name": "Conv2D", "config": {"name": "conv2d_184", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "conv2d_185", "class_name": "Conv2D", "config": {"name": "conv2d_185", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_184", 0, 0, {}]]]}, {"name": "conv2d_186", "class_name": "Conv2D", "config": {"name": "conv2d_186", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_185", 0, 0, {}]]]}, {"name": "conv2d_187", "class_name": "Conv2D", "config": {"name": "conv2d_187", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_186", 0, 0, {}]]]}, {"name": "conv2d_188", "class_name": "Conv2D", "config": {"name": "conv2d_188", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_187", 0, 0, {}]]]}, {"name": "conv2d_189", "class_name": "Conv2D", "config": {"name": "conv2d_189", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_188", 0, 0, {}]]]}, {"name": "conv2d_190", "class_name": "Conv2D", "config": {"name": "conv2d_190", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_189", 0, 0, {}]]]}, {"name": "up_sampling2d_88", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_88", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_190", 0, 0, {}]]]}, {"name": "concatenate_87", "class_name": "Concatenate", "config": {"name": "concatenate_87", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_88", 0, 0, {}], ["conv2d_189", 0, 0, {}]]]}, {"name": "conv2d_191", "class_name": "Conv2D", "config": {"name": "conv2d_191", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_87", 0, 0, {}]]]}, {"name": "up_sampling2d_89", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_89", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_191", 0, 0, {}]]]}, {"name": "concatenate_88", "class_name": "Concatenate", "config": {"name": "concatenate_88", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_89", 0, 0, {}], ["conv2d_188", 0, 0, {}]]]}, {"name": "conv2d_192", "class_name": "Conv2D", "config": {"name": "conv2d_192", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_88", 0, 0, {}]]]}, {"name": "up_sampling2d_90", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_90", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_192", 0, 0, {}]]]}, {"name": "concatenate_89", "class_name": "Concatenate", "config": {"name": "concatenate_89", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_90", 0, 0, {}], ["conv2d_187", 0, 0, {}]]]}, {"name": "conv2d_193", "class_name": "Conv2D", "config": {"name": "conv2d_193", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_89", 0, 0, {}]]]}, {"name": "up_sampling2d_91", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_91", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_193", 0, 0, {}]]]}, {"name": "concatenate_90", "class_name": "Concatenate", "config": {"name": "concatenate_90", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_91", 0, 0, {}], ["conv2d_186", 0, 0, {}]]]}, {"name": "conv2d_194", "class_name": "Conv2D", "config": {"name": "conv2d_194", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_90", 0, 0, {}]]]}, {"name": "up_sampling2d_92", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_92", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_194", 0, 0, {}]]]}, {"name": "concatenate_91", "class_name": "Concatenate", "config": {"name": "concatenate_91", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_92", 0, 0, {}], ["conv2d_185", 0, 0, {}]]]}, {"name": "conv2d_195", "class_name": "Conv2D", "config": {"name": "conv2d_195", "trainable": true, "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_91", 0, 0, {}]]]}, {"name": "up_sampling2d_93", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_93", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_195", 0, 0, {}]]]}, {"name": "concatenate_92", "class_name": "Concatenate", "config": {"name": "concatenate_92", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_93", 0, 0, {}], ["conv2d_184", 0, 0, {}]]]}, {"name": "conv2d_196", "class_name": "Conv2D", "config": {"name": "conv2d_196", "trainable": true, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_92", 0, 0, {}]]]}, {"name": "up_sampling2d_94", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_94", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_196", 0, 0, {}]]]}, {"name": "concatenate_93", "class_name": "Concatenate", "config": {"name": "concatenate_93", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_94", 0, 0, {}], ["input_15", 0, 0, {}]]]}, {"name": "conv2d_197", "class_name": "Conv2D", "config": {"name": "conv2d_197", "trainable": true, "filters": 2, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_93", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0]], "output_layers": [["conv2d_197", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-08, "amsgrad": false}}, "loss": "mean_squared_error", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_184/kernel", "shape": [5, 5, 3, 16], "dtype": "float32"}, {"name": "conv2d_184/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_185/kernel", "shape": [5, 5, 16, 32], "dtype": "float32"}, {"name": "conv2d_185/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_186/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_186/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_187/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_187/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_188/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_188/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_189/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_189/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_190/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_190/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_191/kernel", "shape": [4, 4, 128, 64], "dtype": "float32"}, {"name": "conv2d_191/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_192/kernel", "shape": [4, 4, 128, 64], "dtype": "float32"}, {"name": "conv2d_192/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_193/kernel", "shape": [4, 4, 128, 64], "dtype": "float32"}, {"name": "conv2d_193/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_194/kernel", "shape": [4, 4, 128, 64], "dtype": "float32"}, {"name": "conv2d_194/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_195/kernel", "shape": [4, 4, 96, 32], "dtype": "float32"}, {"name": "conv2d_195/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_196/kernel", "shape": [4, 4, 48, 16], "dtype": "float32"}, {"name": "conv2d_196/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_197/kernel", "shape": [4, 4, 19, 2], "dtype": "float32"}, {"name": "conv2d_197/bias", "shape": [2], "dtype": "float32"}]}]}