{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_23", "layers": [{"name": "input_24", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_24"}, "inbound_nodes": []}, {"name": "conv2d_322", "class_name": "Conv2D", "config": {"name": "conv2d_322", "trainable": true, "filters": 5, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"name": "conv2d_323", "class_name": "Conv2D", "config": {"name": "conv2d_323", "trainable": true, "filters": 10, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_322", 0, 0, {}]]]}, {"name": "conv2d_324", "class_name": "Conv2D", "config": {"name": "conv2d_324", "trainable": true, "filters": 21, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_323", 0, 0, {}]]]}, {"name": "conv2d_325", "class_name": "Conv2D", "config": {"name": "conv2d_325", "trainable": true, "filters": 21, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_324", 0, 0, {}]]]}, {"name": "conv2d_326", "class_name": "Conv2D", "config": {"name": "conv2d_326", "trainable": true, "filters": 21, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_325", 0, 0, {}]]]}, {"name": "conv2d_327", "class_name": "Conv2D", "config": {"name": "conv2d_327", "trainable": true, "filters": 21, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_326", 0, 0, {}]]]}, {"name": "conv2d_328", "class_name": "Conv2D", "config": {"name": "conv2d_328", "trainable": true, "filters": 21, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_327", 0, 0, {}]]]}, {"name": "up_sampling2d_162", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_162", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_328", 0, 0, {}]]]}, {"name": "concatenate_162", "class_name": "Concatenate", "config": {"name": "concatenate_162", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_162", 0, 0, {}], ["conv2d_327", 0, 0, {}]]]}, {"name": "conv2d_329", "class_name": "Conv2D", "config": {"name": "conv2d_329", "trainable": true, "filters": 21, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_162", 0, 0, {}]]]}, {"name": "batch_normalization_143", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_143", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_329", 0, 0, {}]]]}, {"name": "up_sampling2d_163", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_163", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_143", 0, 0, {}]]]}, {"name": "concatenate_163", "class_name": "Concatenate", "config": {"name": "concatenate_163", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_163", 0, 0, {}], ["conv2d_326", 0, 0, {}]]]}, {"name": "conv2d_330", "class_name": "Conv2D", "config": {"name": "conv2d_330", "trainable": true, "filters": 21, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_163", 0, 0, {}]]]}, {"name": "batch_normalization_144", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_144", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_330", 0, 0, {}]]]}, {"name": "up_sampling2d_164", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_164", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_144", 0, 0, {}]]]}, {"name": "concatenate_164", "class_name": "Concatenate", "config": {"name": "concatenate_164", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_164", 0, 0, {}], ["conv2d_325", 0, 0, {}]]]}, {"name": "conv2d_331", "class_name": "Conv2D", "config": {"name": "conv2d_331", "trainable": true, "filters": 21, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_164", 0, 0, {}]]]}, {"name": "batch_normalization_145", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_145", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_331", 0, 0, {}]]]}, {"name": "up_sampling2d_165", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_165", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_145", 0, 0, {}]]]}, {"name": "concatenate_165", "class_name": "Concatenate", "config": {"name": "concatenate_165", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_165", 0, 0, {}], ["conv2d_324", 0, 0, {}]]]}, {"name": "conv2d_332", "class_name": "Conv2D", "config": {"name": "conv2d_332", "trainable": true, "filters": 21, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_165", 0, 0, {}]]]}, {"name": "batch_normalization_146", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_146", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_332", 0, 0, {}]]]}, {"name": "up_sampling2d_166", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_166", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_146", 0, 0, {}]]]}, {"name": "concatenate_166", "class_name": "Concatenate", "config": {"name": "concatenate_166", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_166", 0, 0, {}], ["conv2d_323", 0, 0, {}]]]}, {"name": "conv2d_333", "class_name": "Conv2D", "config": {"name": "conv2d_333", "trainable": true, "filters": 10, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_166", 0, 0, {}]]]}, {"name": "batch_normalization_147", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_147", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_333", 0, 0, {}]]]}, {"name": "up_sampling2d_167", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_167", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_147", 0, 0, {}]]]}, {"name": "concatenate_167", "class_name": "Concatenate", "config": {"name": "concatenate_167", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_167", 0, 0, {}], ["conv2d_322", 0, 0, {}]]]}, {"name": "conv2d_334", "class_name": "Conv2D", "config": {"name": "conv2d_334", "trainable": true, "filters": 5, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_167", 0, 0, {}]]]}, {"name": "batch_normalization_148", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_148", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_334", 0, 0, {}]]]}, {"name": "up_sampling2d_168", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_168", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_148", 0, 0, {}]]]}, {"name": "concatenate_168", "class_name": "Concatenate", "config": {"name": "concatenate_168", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_168", 0, 0, {}], ["input_24", 0, 0, {}]]]}, {"name": "conv2d_335", "class_name": "Conv2D", "config": {"name": "conv2d_335", "trainable": true, "filters": 2, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_168", 0, 0, {}]]]}], "input_layers": [["input_24", 0, 0]], "output_layers": [["conv2d_335", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-08, "amsgrad": false}}, "loss": "mean_squared_error", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_143/gamma", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_143/beta", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_143/moving_mean", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_143/moving_variance", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_144/gamma", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_144/beta", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_144/moving_mean", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_144/moving_variance", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_145/gamma", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_145/beta", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_145/moving_mean", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_145/moving_variance", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_146/gamma", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_146/beta", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_146/moving_mean", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_146/moving_variance", "shape": [21], "dtype": "float32"}, {"name": "batch_normalization_147/gamma", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_147/beta", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_147/moving_mean", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_147/moving_variance", "shape": [10], "dtype": "float32"}, {"name": "batch_normalization_148/gamma", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_148/beta", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_148/moving_mean", "shape": [5], "dtype": "float32"}, {"name": "batch_normalization_148/moving_variance", "shape": [5], "dtype": "float32"}, {"name": "conv2d_322/kernel", "shape": [5, 5, 3, 5], "dtype": "float32"}, {"name": "conv2d_322/bias", "shape": [5], "dtype": "float32"}, {"name": "conv2d_323/kernel", "shape": [3, 3, 5, 10], "dtype": "float32"}, {"name": "conv2d_323/bias", "shape": [10], "dtype": "float32"}, {"name": "conv2d_324/kernel", "shape": [3, 3, 10, 21], "dtype": "float32"}, {"name": "conv2d_324/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_325/kernel", "shape": [3, 3, 21, 21], "dtype": "float32"}, {"name": "conv2d_325/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_326/kernel", "shape": [3, 3, 21, 21], "dtype": "float32"}, {"name": "conv2d_326/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_327/kernel", "shape": [3, 3, 21, 21], "dtype": "float32"}, {"name": "conv2d_327/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_328/kernel", "shape": [3, 3, 21, 21], "dtype": "float32"}, {"name": "conv2d_328/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_329/kernel", "shape": [4, 4, 42, 21], "dtype": "float32"}, {"name": "conv2d_329/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_330/kernel", "shape": [4, 4, 42, 21], "dtype": "float32"}, {"name": "conv2d_330/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_331/kernel", "shape": [4, 4, 42, 21], "dtype": "float32"}, {"name": "conv2d_331/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_332/kernel", "shape": [4, 4, 42, 21], "dtype": "float32"}, {"name": "conv2d_332/bias", "shape": [21], "dtype": "float32"}, {"name": "conv2d_333/kernel", "shape": [4, 4, 31, 10], "dtype": "float32"}, {"name": "conv2d_333/bias", "shape": [10], "dtype": "float32"}, {"name": "conv2d_334/kernel", "shape": [4, 4, 15, 5], "dtype": "float32"}, {"name": "conv2d_334/bias", "shape": [5], "dtype": "float32"}, {"name": "conv2d_335/kernel", "shape": [4, 4, 8, 2], "dtype": "float32"}, {"name": "conv2d_335/bias", "shape": [2], "dtype": "float32"}]}]}