{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "conv2d_155", "class_name": "Conv2D", "config": {"name": "conv2d_155", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "conv2d_156", "class_name": "Conv2D", "config": {"name": "conv2d_156", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_155", 0, 0, {}]]]}, {"name": "conv2d_157", "class_name": "Conv2D", "config": {"name": "conv2d_157", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_156", 0, 0, {}]]]}, {"name": "conv2d_158", "class_name": "Conv2D", "config": {"name": "conv2d_158", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_157", 0, 0, {}]]]}, {"name": "conv2d_159", "class_name": "Conv2D", "config": {"name": "conv2d_159", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_158", 0, 0, {}]]]}, {"name": "conv2d_160", "class_name": "Conv2D", "config": {"name": "conv2d_160", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_159", 0, 0, {}]]]}, {"name": "conv2d_161", "class_name": "Conv2D", "config": {"name": "conv2d_161", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_160", 0, 0, {}]]]}, {"name": "up_sampling2d_78", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_78", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_161", 0, 0, {}]]]}, {"name": "concatenate_78", "class_name": "Concatenate", "config": {"name": "concatenate_78", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_78", 0, 0, {}], ["conv2d_160", 0, 0, {}]]]}, {"name": "conv2d_162", "class_name": "Conv2D", "config": {"name": "conv2d_162", "trainable": true, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_78", 0, 0, {}]]]}, {"name": "up_sampling2d_79", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_79", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_162", 0, 0, {}]]]}, {"name": "concatenate_79", "class_name": "Concatenate", "config": {"name": "concatenate_79", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_79", 0, 0, {}], ["conv2d_159", 0, 0, {}]]]}, {"name": "conv2d_163", "class_name": "Conv2D", "config": {"name": "conv2d_163", "trainable": true, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_79", 0, 0, {}]]]}, {"name": "up_sampling2d_80", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_80", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_163", 0, 0, {}]]]}, {"name": "concatenate_80", "class_name": "Concatenate", "config": {"name": "concatenate_80", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_80", 0, 0, {}], ["conv2d_158", 0, 0, {}]]]}, {"name": "conv2d_164", "class_name": "Conv2D", "config": {"name": "conv2d_164", "trainable": true, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_80", 0, 0, {}]]]}, {"name": "up_sampling2d_81", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_81", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_164", 0, 0, {}]]]}, {"name": "concatenate_81", "class_name": "Concatenate", "config": {"name": "concatenate_81", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_81", 0, 0, {}], ["conv2d_157", 0, 0, {}]]]}, {"name": "conv2d_165", "class_name": "Conv2D", "config": {"name": "conv2d_165", "trainable": true, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_81", 0, 0, {}]]]}, {"name": "up_sampling2d_82", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_82", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_165", 0, 0, {}]]]}, {"name": "concatenate_82", "class_name": "Concatenate", "config": {"name": "concatenate_82", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_82", 0, 0, {}], ["conv2d_156", 0, 0, {}]]]}, {"name": "conv2d_166", "class_name": "Conv2D", "config": {"name": "conv2d_166", "trainable": true, "filters": 8, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_82", 0, 0, {}]]]}, {"name": "up_sampling2d_83", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_83", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_166", 0, 0, {}]]]}, {"name": "concatenate_83", "class_name": "Concatenate", "config": {"name": "concatenate_83", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_83", 0, 0, {}], ["conv2d_155", 0, 0, {}]]]}, {"name": "conv2d_167", "class_name": "Conv2D", "config": {"name": "conv2d_167", "trainable": true, "filters": 4, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_83", 0, 0, {}]]]}, {"name": "up_sampling2d_84", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_84", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_167", 0, 0, {}]]]}, {"name": "concatenate_84", "class_name": "Concatenate", "config": {"name": "concatenate_84", "trainable": true, "axis": 3}, "inbound_nodes": [[["up_sampling2d_84", 0, 0, {}], ["input_12", 0, 0, {}]]]}, {"name": "conv2d_168", "class_name": "Conv2D", "config": {"name": "conv2d_168", "trainable": true, "filters": 2, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_84", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["conv2d_168", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-08, "amsgrad": false}}, "loss": "mean_squared_error", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_155/kernel", "shape": [3, 3, 3, 4], "dtype": "float32"}, {"name": "conv2d_155/bias", "shape": [4], "dtype": "float32"}, {"name": "conv2d_156/kernel", "shape": [3, 3, 4, 8], "dtype": "float32"}, {"name": "conv2d_156/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_157/kernel", "shape": [3, 3, 8, 16], "dtype": "float32"}, {"name": "conv2d_157/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_158/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_158/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_159/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_159/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_160/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_160/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_161/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv2d_161/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_162/kernel", "shape": [4, 4, 32, 16], "dtype": "float32"}, {"name": "conv2d_162/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_163/kernel", "shape": [4, 4, 32, 16], "dtype": "float32"}, {"name": "conv2d_163/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_164/kernel", "shape": [4, 4, 32, 16], "dtype": "float32"}, {"name": "conv2d_164/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_165/kernel", "shape": [4, 4, 32, 16], "dtype": "float32"}, {"name": "conv2d_165/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_166/kernel", "shape": [4, 4, 24, 8], "dtype": "float32"}, {"name": "conv2d_166/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_167/kernel", "shape": [4, 4, 12, 4], "dtype": "float32"}, {"name": "conv2d_167/bias", "shape": [4], "dtype": "float32"}, {"name": "conv2d_168/kernel", "shape": [4, 4, 7, 2], "dtype": "float32"}, {"name": "conv2d_168/bias", "shape": [2], "dtype": "float32"}]}]}